Show / Hide Table of Contents
Class PolyLine2D
Represents a polyline in two-dimensional space.
Inheritance
System.Object
OpenObject
PolyLine2D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry2D.PolyLine2D,CI.Geometry2D")]
public class PolyLine2D : OpenObject
Constructors
Improve this Doc   View Source
PolyLine2D()
Constructor
Declaration
public PolyLine2D()
Properties
Improve this Doc   View Source
Segments
Gets segments of PolyLine2D.
Declaration
public List<Segment2D> Segments { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Segment2D>
Improve this Doc   View Source
StartPoint
Gets or sets the point where the PolyLine2D begins.
Declaration
public Point2D StartPoint { get; set; }
Property Value
 Type |  Description
 Point2D
 Improve this Doc
 View Source